mcuxrandall/2.04-Integration/MCXN947_TXST_Peripheral_Integration/board/pin_mux.h
/* Symbols to be used with GPIO driver */
#define BOARD_INITBUTTONSPINS_SW2_GPIO GPIO0                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITBUTTONSPINS_SW2_GPIO_PIN 23U              /*!<@brief GPIO pin number */
#define BOARD_INITBUTTONSPINS_SW2_GPIO_PIN_MASK (1U << 23U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITBUTTONSPINS_SW2_PORT PORT0                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITBUTTONSPINS_SW2_PIN 23U                   /*!<@brief PORT pin number */
#define BOARD_INITBUTTONSPINS_SW2_PIN_MASK (1U << 23U)      /*!<@brief PORT pin mask */
                                                            /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitBUTTONsPins(void);

#define PCR_DSE_dse0 0x00u /*!<@brief Drive Strength Enable: Low */
#define PCR_DSE_dse1 0x01u /*!<@brief Drive Strength Enable: High */
#define PCR_IBE_ibe1 0x01u /*!<@brief Input Buffer Enable: Enables */

/*! @name PORT0_2 (coord B16), P0_2/SWO/J23[6]/D16[4]
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_DEBUG_SWD_SWO_PORT PORT0               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_DEBUG_SWD_SWO_PIN 2U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_DEBUG_SWD_SWO_PIN_MASK (1U << 2U)      /*!<@brief PORT pin mask */
                                                              /* @} */

/*! @name ADC0_A0 (coord P3), ADC0_A0/ARD_A0/J4[2]/Potentiometer/ADC0_A0/ARD_A0/J4[2]/ADC0_A0/ARD_A0/J4[2]
  @{ */
/* @} */

/*! @name PORT4_12 (coord T6), P4_12/SJ25[1]/J8[17]/Switch_0/P4_12/SJ25[1]/J8[17]/P4_12/SJ25[1]/J8[17]
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_Switch_0_GPIO GPIO4                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_Switch_0_GPIO_PIN 12U              /*!<@brief GPIO pin number */
#define BOARD_INITPINS_Switch_0_GPIO_PIN_MASK (1U << 12U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_Switch_0_PORT PORT4                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_Switch_0_PIN 12U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_Switch_0_PIN_MASK (1U << 12U)      /*!<@brief PORT pin mask */
                                                          /* @} */

/*! @name PORT0_14 (coord E11), P0_14/J4[6]/SJ19[3]/Switch_1/P0_14/J4[6]/SJ19[3]/P0_14/J4[6]/SJ19[3]
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_Switch_1_GPIO GPIO0                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_Switch_1_GPIO_PIN 14U              /*!<@brief GPIO pin number */
#define BOARD_INITPINS_Switch_1_GPIO_PIN_MASK (1U << 14U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_Switch_1_PORT PORT0                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_Switch_1_PIN 14U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_Switch_1_PIN_MASK (1U << 14U)      /*!<@brief PORT pin mask */
                                                          /* @} */

/*! @name PORT0_22 (coord B8), P0_22/J4[8]/SJ18[3]/Switch_2/P0_22/J4[8]/SJ18[3]/P0_22/J4[8]/SJ18[3]
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_Switch_2_GPIO GPIO0                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_Switch_2_GPIO_PIN 22U              /*!<@brief GPIO pin number */
#define BOARD_INITPINS_Switch_2_GPIO_PIN_MASK (1U << 22U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_Switch_2_PORT PORT0                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_Switch_2_PIN 22U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_Switch_2_PIN_MASK (1U << 22U)      /*!<@brief PORT pin mask */
                                                          /* @} */

/*! @name PORT0_30 (coord E7), P0_30/SJ2[1]/LED_0/P0_30/SJ2[1]/P0_30/SJ2[1]
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_LED_0_GPIO GPIO0                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_LED_0_INIT_GPIO_VALUE 0U        /*!<@brief GPIO output initial state */
#define BOARD_INITPINS_LED_0_GPIO_PIN 30U              /*!<@brief GPIO pin number */
#define BOARD_INITPINS_LED_0_GPIO_PIN_MASK (1U << 30U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_LED_0_PORT PORT0                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_LED_0_PIN 30U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_LED_0_PIN_MASK (1U << 30U)      /*!<@brief PORT pin mask */
                                                       /* @} */

/*! @name PORT4_16 (coord R8), P4_16/SJ23[1]/J8[21]/LED_1/P4_16/SJ23[1]/J8[21]/P4_16/SJ23[1]/J8[21]
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_LED_1_GPIO GPIO4                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_LED_1_INIT_GPIO_VALUE 0U        /*!<@brief GPIO output initial state */
#define BOARD_INITPINS_LED_1_GPIO_PIN 16U              /*!<@brief GPIO pin number */
#define BOARD_INITPINS_LED_1_GPIO_PIN_MASK (1U << 16U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_LED_1_PORT PORT4                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_LED_1_PIN 16U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_LED_1_PIN_MASK (1U << 16U)      /*!<@brief PORT pin mask */
                                                       /* @} */

/*! @name PORT1_23 (coord M4), P1_23/J9[23]/SJ1[1]/LED_2/P1_23/J9[23]/SJ1[1]/P1_23/J9[23]/SJ1[1]
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_LED_2_GPIO GPIO1                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_LED_2_INIT_GPIO_VALUE 0U        /*!<@brief GPIO output initial state */
#define BOARD_INITPINS_LED_2_GPIO_PIN 23U              /*!<@brief GPIO pin number */
#define BOARD_INITPINS_LED_2_GPIO_PIN_MASK (1U << 23U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_LED_2_PORT PORT1                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_LED_2_PIN 23U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_LED_2_PIN_MASK (1U << 23U)      /*!<@brief PORT pin mask */
                                                       /* @} */

/*! @name PORT4_20 (coord T10), P4_20/SJ21[1]/J8[25]/Button_0/P4_20/SJ21[1]/J8[25]/P4_20/SJ21[1]/J8[25]
  @{ */

