mcuxrandall/2.04-Integration/MCXN947_TXST_Peripheral_Integration/board/pin_mux.h
/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_Button_0_GPIO GPIO4                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_Button_0_GPIO_PIN 20U              /*!<@brief GPIO pin number */
#define BOARD_INITPINS_Button_0_GPIO_PIN_MASK (1U << 20U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_Button_0_PORT PORT4                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_Button_0_PIN 20U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_Button_0_PIN_MASK (1U << 20U)      /*!<@brief PORT pin mask */
                                                          /* @} */

/*! @name PORT0_15 (coord G13), P0_15/SJ8[1]/Button_1/P0_15/SJ8[1]/P0_15/SJ8[1]
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_Button_1_GPIO GPIO0                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_Button_1_GPIO_PIN 15U              /*!<@brief GPIO pin number */
#define BOARD_INITPINS_Button_1_GPIO_PIN_MASK (1U << 15U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_Button_1_PORT PORT0                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_Button_1_PIN 15U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_Button_1_PIN_MASK (1U << 15U)      /*!<@brief PORT pin mask */
                                                          /* @} */

/*! @name PORT2_4 (coord K3), P2_4/TP26/J12[5]/J3[11]/SJ5[3]/RGB_A1_PWM/P2_4/TP26/J12[5]/J3[11]/SJ5[3]/P2_4/TP26/J12[5]/J3[11]/SJ5[3]
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_RGB_A1_PWM_PORT PORT2               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_RGB_A1_PWM_PIN 4U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_RGB_A1_PWM_PIN_MASK (1U << 4U)      /*!<@brief PORT pin mask */
                                                           /* @} */

/*! @name PORT2_5 (coord K1), P2_5/TP25/J12[3]/J3[9]/SJ6[3]/RGB_B1_PWM/P2_5/TP25/J12[3]/J3[9]/SJ6[3]/P2_5/TP25/J12[3]/J3[9]/SJ6[3]
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_RGB_B1_PWM_PORT PORT2               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_RGB_B1_PWM_PIN 5U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_RGB_B1_PWM_PIN_MASK (1U << 5U)      /*!<@brief PORT pin mask */
                                                           /* @} */

/*! @name PORT2_2 (coord H3), P2_2/TP5/J12[8]/J3[7]/SJ7[3]/RGB_A2_PWM/P2_2/TP5/J12[8]/J3[7]/SJ7[3]/P2_2/TP5/J12[8]/J3[7]/SJ7[3]
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_RGB_A2_PWM_PORT PORT2               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_RGB_A2_PWM_PIN 2U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_RGB_A2_PWM_PIN_MASK (1U << 2U)      /*!<@brief PORT pin mask */
                                                           /* @} */

/*! @name PORT0_24 (coord B6), P0_24/SJ7[1]
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_PWMA_PORT PORT0                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_PWMA_PIN 24U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_PWMA_PIN_MASK (1U << 24U)      /*!<@brief PORT pin mask */
                                                      /* @} */

/*! @name PORT2_6 (coord K2), P2_6/TP24/J12[2]/J3[15]/SJ1[3]/RGB_A0_PWM/P2_6/TP24/J12[2]/J3[15]/SJ1[3]/P2_6/TP24/J12[2]/J3[15]/SJ1[3]
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_Motor_AIN1_GPIO GPIO2               /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_Motor_AIN1_INIT_GPIO_VALUE 0U       /*!<@brief GPIO output initial state */
#define BOARD_INITPINS_Motor_AIN1_GPIO_PIN 6U              /*!<@brief GPIO pin number */
#define BOARD_INITPINS_Motor_AIN1_GPIO_PIN_MASK (1U << 6U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_Motor_AIN1_PORT PORT2               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_Motor_AIN1_PIN 6U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_Motor_AIN1_PIN_MASK (1U << 6U)      /*!<@brief PORT pin mask */
                                                           /* @} */

/*! @name PORT2_7 (coord L2), P2_7/TP23/J12[1]/J3[13]/SJ3[3]/RGB_B0_PWM/P2_7/TP23/J12[1]/J3[13]/SJ3[3]/P2_7/TP23/J12[1]/J3[13]/SJ3[3]
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_Motor_AIN2_GPIO GPIO2               /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_Motor_AIN2_INIT_GPIO_VALUE 0U       /*!<@brief GPIO output initial state */
#define BOARD_INITPINS_Motor_AIN2_GPIO_PIN 7U              /*!<@brief GPIO pin number */
#define BOARD_INITPINS_Motor_AIN2_GPIO_PIN_MASK (1U << 7U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_Motor_AIN2_PORT PORT2               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_Motor_AIN2_PIN 7U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_Motor_AIN2_PIN_MASK (1U << 7U)      /*!<@brief PORT pin mask */
                                                           /* @} */

/*! @name PORT2_0 (coord H2), P2_0/J3[1]/SJ8[3]
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_Motor_STANDBY_GPIO GPIO2               /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_Motor_STANDBY_INIT_GPIO_VALUE 0U       /*!<@brief GPIO output initial state */
#define BOARD_INITPINS_Motor_STANDBY_GPIO_PIN 0U              /*!<@brief GPIO pin number */
#define BOARD_INITPINS_Motor_STANDBY_GPIO_PIN_MASK (1U << 0U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_Motor_STANDBY_PORT PORT2               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_Motor_STANDBY_PIN 0U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_Motor_STANDBY_PIN_MASK (1U << 0U)      /*!<@brief PORT pin mask */
                                                              /* @} */

