mcuxrandall/2.04-Integration/MCXN947_TXST_Peripheral_Integration/board/pin_mux.h
/*! @name PORT0_26 (coord F10), P0_26/J2[10]
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_PWMB_PORT PORT0                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_PWMB_PIN 26U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_PWMB_PIN_MASK (1U << 26U)      /*!<@brief PORT pin mask */
                                                      /* @} */

/*! @name PORT2_3 (coord J3), P2_3/TP4/J12[7]/J3[5]/SJ4[3]/RGB_B2_PWM/P2_3/TP4/J12[7]/J3[5]/SJ4[3]/P2_3/TP4/J12[7]/J3[5]/SJ4[3]
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_Motor_BIN1_GPIO GPIO2               /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_Motor_BIN1_INIT_GPIO_VALUE 0U       /*!<@brief GPIO output initial state */
#define BOARD_INITPINS_Motor_BIN1_GPIO_PIN 3U              /*!<@brief GPIO pin number */
#define BOARD_INITPINS_Motor_BIN1_GPIO_PIN_MASK (1U << 3U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_Motor_BIN1_PORT PORT2               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_Motor_BIN1_PIN 3U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_Motor_BIN1_PIN_MASK (1U << 3U)      /*!<@brief PORT pin mask */
                                                           /* @} */

/*! @name PORT1_22 (coord L4), P1_22/J9[24]/J3[3]/SJ9[3]
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_Motor_BIN2_GPIO GPIO1                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_Motor_BIN2_INIT_GPIO_VALUE 0U        /*!<@brief GPIO output initial state */
#define BOARD_INITPINS_Motor_BIN2_GPIO_PIN 22U              /*!<@brief GPIO pin number */
#define BOARD_INITPINS_Motor_BIN2_GPIO_PIN_MASK (1U << 22U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_Motor_BIN2_PORT PORT1                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_Motor_BIN2_PIN 22U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_Motor_BIN2_PIN_MASK (1U << 22U)      /*!<@brief PORT pin mask */
                                                            /* @} */

/*! @name PORT4_18 (coord N10), P4_18/J8[23]
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_Board_output_PORT PORT4                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_Board_output_PIN 18U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_Board_output_PIN_MASK (1U << 18U)      /*!<@brief PORT pin mask */
                                                              /* @} */

/*! @name PORT4_22 (coord T12), P4_22/J8[27]
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_Board_input_PORT PORT4                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_Board_input_PIN 22U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_Board_input_PIN_MASK (1U << 22U)      /*!<@brief PORT pin mask */
                                                             /* @} */

/*! @name PORT4_1 (coord P2), P4_1/J8[3]/SJ15[1]
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_OLED_I2C_SCK_PORT PORT4               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_OLED_I2C_SCK_PIN 1U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_OLED_I2C_SCK_PIN_MASK (1U << 1U)      /*!<@brief PORT pin mask */
                                                             /* @} */

/*! @name PORT4_0 (coord P1), P4_0/J8[4]/SJ14[1]
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_OLED_I2C_SDA_PORT PORT4               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_OLED_I2C_SDA_PIN 0U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_OLED_I2C_SDA_PIN_MASK (1U << 0U)      /*!<@brief PORT pin mask */
                                                             /* @} */

/*! @name PORT3_23 (coord M15), P3_23/J6[3]
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_microSD_CS_PORT PORT3                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_microSD_CS_PIN 23U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_microSD_CS_PIN_MASK (1U << 23U)      /*!<@brief PORT pin mask */
                                                            /* @} */

/*! @name PORT3_21 (coord L16), P3_21/J6[4]/J1[15]
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_microSD_CLK_PORT PORT3                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_microSD_CLK_PIN 21U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_microSD_CLK_PIN_MASK (1U << 21U)      /*!<@brief PORT pin mask */
                                                             /* @} */

/*! @name PORT3_22 (coord M16), P3_22/J6[5]
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_microSD_MISO_PORT PORT3                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_microSD_MISO_PIN 22U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_microSD_MISO_PIN_MASK (1U << 22U)      /*!<@brief PORT pin mask */
                                                              /* @} */

/*! @name PORT3_20 (coord M17), P3_20/J6[6]/J1[5]
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_microSD_MOSI_PORT PORT3                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_microSD_MOSI_PIN 20U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_microSD_MOSI_PIN_MASK (1U << 20U)      /*!<@brief PORT pin mask */
                                                              /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPins(void);

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPins1(void);

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitI3CPins(void);

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
